---
kind: type
id: T:Autodesk.Revit.DB.Events.ProjectBrowserDataChangedEventArgs
source: html/5b2c5f46-7ed5-25ce-e796-4d6cb963802c.htm
---
# Autodesk.Revit.DB.Events.ProjectBrowserDataChangedEventArgs

The event arguments used by the ProjectBrowserDataChanged event.

## Syntax (C#)
```csharp
public class ProjectBrowserDataChangedEventArgs : RevitAPISingleEventArgs
```